<!DOCTYPE html>
<!-- Microdata markup added by Google Structured Data Markup Helper. -->
<html lang="es"><head>
    <meta charset="utf-8"/>
    <link rel="icon" href="./imgs/logo.png"/>
    <meta name="google" content="notranslate" />
    <meta http-equiv="Content-Language" content="es"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <title>Josu&eacute; Tonelli Cueto: Investigaci&oacute;n</title>
    <meta name="description" content="Intereses de investigaci&oacute;n y lista de publicaciones de Josu&eacute; Tonelli Cueto" />
    <!--Social Media metadata-->
    <meta property="og:type" content="website" >
    <meta property="og:locale" content="es_ES" />
    <meta property="og:locale:alternate" content="en_US" />
    <meta property="og:url" content="https://tonellicueto.xyz/research_es.html" />
    <meta property="og:title" content="Josu&eacute; Tonelli Cueto: Investigaci&oacute;n" /><!--35char-->
    <meta property="og:description" content="Intereses matem&aacute;ticos y publicaciones acad&eacute;micas"><!--65char-->
    <meta property="og:image" content="https://tonellicueto.xyz/imgs/SM4.png"><!--300KB and minimum dimensions of 300 x 200-->
    <!--Twitter metadata-->
    <meta name="twitter:card" content="summary" />
    <meta name="twitter:site" content="@tonellicueto" />
    <meta name="twitter:creator" content="@tonellicueto" />
    <meta name="twitter:title" content="Josu&eacute; Tonelli Cueto: Investigaci&oacute;n" />
    <meta name="twitter:description" content="Intereses matem&aacute;ticos y publicaciones acad&eacute;micas de Josu&eacute; Tonelli Cueto." />
    <meta name="twitter:image" content="https://tonellicueto.xyz/imgs/SM4.jpg" />
    <!--  Bootstrap core CSS  -->
    <link href="css/bootstrap.min.css" rel="stylesheet"/>
    <!--  Custom styles for this template  -->
    <link href="css/style2.css" rel="stylesheet"/>
    <link href="css/style_cv.css" rel="stylesheet"/>
    <link rel="stylesheet" href="https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css">
    <link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.8.1/css/all.css" integrity="sha384-50oBUHEmvpQ+1lW4y57PTFmhCaXp0ML5d60M1M7uH2+nqUivzIebhndOJK28anvf" crossorigin="anonymous">
</head>

  <body data-spy="scroll" data-target="#navbarCV" data-offset="105">
<div class="fixed-top" data-toggle="affix">
   <nav class="navbar navbar-toggleable-md navbar-inverse navbar-custom" id="general">
      <button class="navbar-toggler navbar-toggler-right" type="button" data-toggle="collapse" data-target="#navbarsExampleDefault" aria-controls="navbarsExampleDefault" aria-expanded="false" aria-label="Toggle navigation">
        <span class="navbar-toggler-icon"></span>
      </button>
      <a class="navbar-brand" href="index.html"><img src="imgs/logo.png" alt="weblogo"/></a>

      <div class="collapse navbar-collapse " id="navbarsExampleDefault">
        <ul class="navbar-nav mr-auto">
          <li class="nav-item">
            <a class="nav-link" href="index_es.html">Inicio</a>
          </li>

          <li class="nav-item">
            <a class="nav-link" href="https://illsaidthoughts.xyz/">Blog</a>
          </li>

	  <li class="nav-item active">
            <a class="nav-link" href="research_es.html">Investigaci&oacute;n</a>
          </li>

	  <li class="nav-item">
            <a class="nav-link" href="non-research_es.html">No Investigaci&oacute;n</a>
          </li>


          <li class="nav-item">
            <a class="nav-link" href="cv_es.html">CV</a>
          </li>

	  <li class="nav-item">
            <a class="nav-link" href="multimedia_es.html">Multimedia</a>
          </li>

	<li class="nav-item">
            <a class="nav-link" href="contact_es.html">Contacto</a>
          </li>

        </ul>

        <ul class="navbar-nav r-auto">
	<li class="nav-item">
            <a class="nav-link" href="research.html">en</a>
          </li>
	<li class="nav-item active">
            <a class="nav-link" href="research_es.html">es</a>
          </li>
        </ul>
      </div>

    </nav>
   <nav id="navbarCV" class="navbar-toggleable-md navbar-inverse navbar-custom2">
        <ul class="nav nav-pills">
	         <li class="nav-item"><a class="nav-link active" href="#" style="background-color: #ee2523!important;color: white!important;"><i class="fas fa-square-root-alt"></i></a></li>
	         <li class="nav-item"><a class="nav-link" href="#areas">&aacute;reas de inter&eacute;s</a></li>
           <!--<li class="nav-item"><a class="nav-link" href="#topics">Topics of interest</a></li>-->
           <!--<li class="nav-item"><a class="nav-link" href="#papers">Art&iacute;culos cient&iacute;ficos y preprints</a></li>-->
           <li class="nav-item"><a class="nav-link" href="#preprints">Preprints</a></li>
           <li class="nav-item"><a class="nav-link" href="#journalpapers">Art&iacute;culos cient&iacute;ficos de revista</a></li>
           <li class="nav-item"><a class="nav-link" href="#conferencepapers">Art&iacute;culos cient&iacute;ficos de conferencia</a></li>
           <li class="nav-item"><a class="nav-link" href="#other">Otras publicaciones</a></li>
        </ul>
    </nav>
</div>


    <!--  Main jumbotron for a primary marketing message or call to action  -->

<div class="jumbotron" style="text-align:center;">
      <div class="container">

        <h2 class="display-4">Investigaci&oacute;n</h2>de<h2 class="display-4">Josu&eacute; Tonelli Cueto</h2>

     </div>
</div>


<div class="container">
<hr>
<div id="areas">
  <h2 class="display-4">&aacute;reas de inter&eacute;s</h2>
  <p>
    Aunque tengo intereses en otras &aacute;reas de las matem&aacute;ticas, mis principales &aacute;reas de interes son los algoritmos num&eacute;ricos y la complejidad basada en condici&oacute;n, la geometr&iacute;a algebraica aleatoria y la geoemtr&iacute;a aleatoria.
  </p>
  <h3>Algoritmos num&eacute;ricos y complejidad basada en condici&oacute;n</h3>
  <p>
    Los algoritmos num&eacute;ricos son algoritmos y por lo tanto discretos en su naturaleza. Estos son especificados por un <em>programa</em> finito y realizan una computaci&oacute;n compuesta por una sucesi&oacute;n discreta de operaciones l&oacute;gicas/aritm&eacute;ticas. Su diferencia con respecto a los algoritmos cl&aacute;sicos yace en que estos tratan con <em>problemas continuos</em> donde el dato de entrada (y salida) est&aacute;n descritos parcialmente por sucesiones de n&uacute;meros reales (y complejos). Con estos &uacute;ltimos, el algoritmo num&eacute;rico puede trabajar solamente con aproximaciones de ellos y no los n&uacute;meros reales en s&iacute; mismos. En otras palabras, un algoritmo num&eacute;rico est&aacute; condenado a funcionar con datos de entrada inexactos, debe redondear los n&uacute;meros a medida que se ejecuta y puede producir &uacute;nicamente respuestas aproximadas para el problema continuo con el que trata (cuando esta respuesta incluye n&uacute;meros reales). A pesar de todo esto, los algoritmos num&eacute;ricos consiguen resolver problemas tanto en teor&iacute;a como en la pr&aacute;ctica. Esto convierte a los algoritmos num&eacute;ricos en el oximor&oacute;n por el que lo discreto explora lo continuo.
  </p>
  <p>
    Analizar la complejidad de los algoritmos num&eacute;ricos es un desaf&iacute;o. Con ellos, no hay esperanza de que la familiar complejidad del peor caso funcione. No importa cu&aacute;n peque&ntilde;o es el error que se permite en las aproximaciones, siempre habr&aacute; datos de entrada para los estos errores har&aacute;n que el algoritmo o bien produzca una respuesta incorrecta o bien nunca pare. Hay dos formas de solucionar este problema: la complejidad del peor caso en datos de entrada restringidos y la complejidad basada en condici&oacute;n.
  </p>
  <p>
    En la <em>complejidad del peor caso en datos de entrada restringidos</em>, se restringen los datos de entrada que se permiten para el algoritmo num&eacute;rico. Esta restricci&oacute;n se hace permitiendo &uacute;nicamente n&uacute;meros racionales de tama&ntilde;o bit acotado en los datos de entrada y considerando &uacute;nicamente datos de entrada <em>bien puestos</em>, que son aquellos para los que errores &ldquo;razonablemente&rdquo; peque&ntilde;os no afectan &ldquo;dram&aacute;ticamente&rdquo; a la respuesta del problema considerado. Aunque muchas veces exitoso, este analisis de complejidad tiende a dar cotas que est&aacute;n muy lejos del comportamiento observado en la pr&aacute;ctica y fracasa a la hora de explicar el fen&oacute;meno por el que no todos los datos de entrada toman el mismo tiempo.
  </p>
  <p>
    En la <em>complejidad basada en condici&oacute;n</em>, se realiza un an&aacute;lisis de complejidad parametrizada en t&eacute;rminos de una propiedad del dato de entrada llamada <em>n&uacute;mero de condici&oacute;n</em>. El n&uacute;mero de condici&oacute;n es una medida cuantitativa de la <em>senibilidad num&eacute;rica</em> del dato de entrada para el problema continuo dado y dice cu&aacute;nto var&iacute;a el dato de salida con respecto a cu&aacute;nto var&iacute;a el dato de entrada. Los n&uacute;meros de condici&oacute;n pueden variar dependiendo en c&oacute;mo medimos las variaciones (por ejemplo, norma m&aacute;xima contra eucl&iacute;dea) y en la naturaleza de las variaciones que consideramos (por ejemplo, peor caso contra promedio). Sin embargo, los n&uacute;meros de condici&oacute;n son independiente del algoritmo analizado, son una propiedad geom&eacute;trica de los datos de entrada con respecto al problema continuo considerado con la que se puede explicar el comportamiento de los algoritmos num&eacute;ricos en la pr&aacute;ctica y porqu&eacute; algunos datos de entrada requieren m&aacute;s tiempo que otros.
  </p>
  <p>
    Aun m&aacute;s, la complejidad basada en condici&oacute;n nos permite entender cu&aacute;nta precisi&oacute;n requiere un algoritmo num&eacute;rico para garantizar un dato de salida conrrecto y c&oacute;mo este algoritmo se comporta probabil&iacute;sticamente, si asumimos una distribuci&oacute;n de probabilidad razonable en el dato de entrada. En el primer caseo, la precisi&oacute;n necesitada est&aacute; generalmente controlada por el logaritmo del n&uacute;mero de condici&oacute;n. En el segundo caso, el estudio de la distribuci&oacute;n del n&uacute;mero de condici&oacute;n de un problema en un dato de entrada aleatorio permite obtener estimaciones de complejidad con alta probabilidad (complejidad d&eacute;bil) y en promedio (complejidad promedio).
  </p>
  <p>
    Mis intereses se centran en el desarrollo y an&aacute;lisis del algoritmos num&eacute;ricos para una variedad de problemas (mayoritariamente el geometr&iacute;a algebraica num&eacute;rica) dentro del marco de la complejidad basada en condici&oacute;n. En esta meta, me interesa en particular desarrollar y analizar algoritmos num&eacute;ricos basados en subdivisi&oacute;n adaptativa y mejorar los an&aacute;lisis de complejidad existentes explorando, por ejemplo, medidas alternativas de los errores y distribuciones m&aacute;s generales.
  </p>
  <h3>Geometr&iacute;a algebraica computacional</h3>
  <p>
    La geometr&iacute;a algebraica trata en general con objetos que se pueden definir en funci&oacute;n de polinomios y las propiedades de estos objetos. Con la llegada de los ordenadores, la posibilidad de convertir ciertos m&eacute;todos constructivos, pero humanamente impracticables, en algoritmos &uacute;tiles se hizo real. Esta posibilidad estaba motivada tambi&eacute;n por el hecho de que los polinomios aparecen en muchas aplicaciones (brazos rob&oacute;ticos, redes qu&iacute;micas, sistemas din&aacute;micos, etc.), lo que hizo que esta posibilidad se convirtiera adem&aacute;s en una necesidad. Esta posibilidad algor&iacute;tmica es el objeto de estudio de la geometr&iacute;a algebraica computaciones cuya meta es desarrollar y analizar algoritmos que resuelvan problemas en geometr&iacute;a algebraica.
  </p>
  <p>
    Entre los posibles desaf&iacute;os computaciones, mi trabajo se centra en la b&uacute;squeda de ceros de ecuaciones polin&oacute;micas y en la computaci&oacute;n de invariantes topol&oacute;gicos de conjuntos semiagebraicos, que son aquellos conjuntos descritos por polinomios reales, desigualdades y sus combinaciones. En el primer problema, me interesa comprender te&oacute;ricamente mejor los trucos del practicante desde la perspectiva de la complejidad en el caso complejo y los m&eacute;todos de subdivisi&oacute;n y rejilla en el caso real. En el segundo tema, intento desarrollar un algoritmo que compute la homolog&iacute;a de conjuntos semialgebraicos en tiempo medio simplemente exponencial en contraposici&oacute;n al estado del arte actual en el que o bien los algoritmos son doblemente exponenciales en el peor caso o bien simplemente exponenciales con alta probabilidad. Mi proyecto a largo plazo es usar la geometr&iacute;a algebraica computacional para atacar exit&oacute;samente la primera parte del d&eacute;cimosexto problema de Hilbert en grados altos.
  </p>
  <h3>Geometr&iacute;a aleatoria</h3>
  <p>
    Dada una estructura geom&eacute;trica aleatoria, &iquest;qu&eacute; podemos decir acerca de la distribuci&oacute;n de sus propiedades? Podemos preguntarnos acerca de las propiedades topol&oacute;gicas del objeto. Por ejemplo, dado un sistema polinomial aleatorio, &iquest;cu&aacute;l es la distribuci&oacute;n de su num&eacute;ro de ceros? O, dado un sistema polinomial subdeterminado aleatorio, &iquest;cu&aacute;l es la distribuci&oacute;n de los n&uacute;meros de Betti de su conjunto de ceros? Y podemos considerar tambi&eacute;n las propiedades geom&eacute;tricas del objeto. Por ejemplo, dado un sistema polinomial aleatorio, &iquest;cu&aacute;l es la distribuci&oacute;n de la distancia m&iacute;nima entre dos de sus ceros? O, dado un sistema polinomial subdeterminado aleatorio, &iquest;cu&aacute;l es la distribuci&oacute;n del alcance (reach) de su conjunto de ceros?
  </p>
  <p>
    La centralidad de esta pregunta se puede apreciar en varios lugares. Primero, en aplicaciones, esta puede ayudar a comprender por qu&eacute; ciertos fen&oacute;menos son m&aacute;s comunes que otros. Segundo, en los algoritmos constructivos, esta puede ayudar a explicar por qu&eacute; ciertos m&eacute;todos fallan a la hora de producir ejemplos de un determinado tipo o por qu&eacute; producir&aacute; exit&oacute;samente ejemplos del tipo deseado. Tercero, en geometr&iacute;a lagebraica real, la geometr&iacute;a aleatoria es el &uacute;nico medio de entender qu&eacute; sucede &ldquo;en general&rdquo; dado que, en contraposici&oacute;n al caso complejo, no hay comportamiento gen&eacute;rico en el mundo real.
  </p>
  <p>
    Mis intereses en geometr&iacute;a aleatoria se centran en la distribuci&oacute;n de invariantes topol&oacute;gicos y, por suepuesto, los n&uacute;meros de condici&oacute;n de sistemas polin&oacute;micos aleatorios. Un meta futura particular es generalizar los m&eacute;todos actuales en geometr&iacute;a algebraica real aleatoria de distribuciones gaussianas a distribuciones m&aacute;s generales, haciendo las estimaciones probabil&iacute;sticas actuales m&aacute;s robustas.
  </p>
</div>
<hr>
<div id="preprints">
  <h2 class="display-4">Preprints <a class="btn btn-arxiv" href="arXiv.html" role="button" style="font-size:0.6em;"><i class="ai ai-arxiv-square"></i> Preprints en arXiv</a></h2>
  <!--<p style="margin:0;">Los siguientes son mi art&iacute;culos cient&iacute;ficos y preprints en los &uacute;ltimos a&ntilde;os. Para una lista completa, consultar <a href="cv.html#publications">la lista de mi CV</a> o <a href="arXiv.html">mi lista de preprints de arXiv</a>.</p>-->

  <!--<br/><div class="cv">
   <div class="year"></div><div class="paper"><h4>&emsp;Beyond Worst-Case Analysis for Root Isolation Algorithms<a class="btn btn-arxiv" href="https://arxiv.org/abs/2202.06428" role="button">arXiv:2202.06428</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">(Junto a <a href="http://alpergur.xyz/">Alperen A. Erg&uuml;r</a> and <a href="https://who.paris.inria.fr/Elias.Tsigaridas/">Elias Tsigaridas</a>)</div>
  </div>

  <br/><div class="cv">
   <div class="year"></div><div class="paper"><h4>&emsp;On the Error of Random Sampling: Uniformly Distributed Random Points on Parametric Curves<a class="btn btn-arxiv" href="https://arxiv.org/abs/2203.02832" role="button">arXiv:2203.02832</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">(Junto a <a href="https://tolischal.github.io/">Apostolos Chalkis</a> and <a href="https://webusers.imj-prg.fr/~christina.katsamaki/">Christina Katsamaki</a>)</div>
 </div>-->

 <br/><div class="cv">
  <div class="year"><h4>2022</h4></div><div class="paper"><h4>&emsp;Generalized Perron Roots and Solvability of the Absolute Value Equation<a class="btn btn-arxiv" href="https://arxiv.org/abs/1912.08157" role="button">arXiv:1912.08157</a></h4></div>
  <div class="pretalktitle"></div><div class="collaborator">(Junto a <a href="https://page.math.tu-berlin.de/~radons/">Manuel Radons</a>)</div>
 </div>

  <br/><div class="cv">
   <div class="year"></div><div class="paper"><h4>&emsp;A $p$-adic Descartes solver: the Strassman solver<a class="btn btn-arxiv" href="https://arxiv.org/abs/2203.07016" role="button">arXiv:2203.07016</a></h4></div>
   <div class="pretalktitle"></div>
  </div>

	<br/><div class="cv">
	 <div class="year"></div><div class="paper"><h4>&emsp;Probabilistic bounds on best rank-one approximation ratio<a class="btn btn-arxiv" href="https://arxiv.org/abs/2201.02191" role="button">arXiv:2201.02191</a></h4></div>
	 <div class="pretalktitle"></div><div class="collaborator">(Junto a <a href="https://www.mathematik.uni-osnabrueck.de/forschung/ag_angewandte_algebra_und_Fechananalyse/kozhasov_khazhgali.html">Khazhgali Kozhasov</a>)</div>
	</div>

</div>
<hr>
<div id="journalpapers">
  <h2 class="display-4">Art&iacute;culos cient&iacute;ficos de revista</h2>

	<br/><div class="cv">
	<div class="year"><h4>2023</h4></div><div class="paper"><h4>&emsp;Condition Numbers for the Cube.<br/>&emsp;I: Univariate Polynomials and Hypersurfaces<a class="btn btn-arxiv" href="https://arxiv.org/abs/2006.04423" role="button">arXiv:2006.04423</a></h4></div>
	 <div class="pretalktitle"></div><div class="collaborator">J. Tonelli-Cueto and E. Tsigaridas. Condition Numbers for the Cube. I: Univariate Polynomials and Hypersurfaces (Ingl&eacute;s) [N&uacute;meros de Condici&oacute;n para el Cubo. I: Polinomios Univariados e Hipersuperficies], <i>Journal of Symbolic Computation</i>, 115:142-173, 2023. First on-line: August 2022. <span><a href="https://doi.org/10.1016/j.jsc.2022.08.013">DOI 10.1016/j.jsc.2022.08.013</a></span></div>
	 <div class="pretalktitle"></div><div class="collaborator">Journal version of <em>Condition Numbers for the Cube. I: Univariate Polynomials and Hypersurfaces</em> in the Special Issue of ISSAC'20.</div>
	</div>

	<br/><div class="cv">
	 <div class="year"><h4>2022</h4></div><div class="paper"><h4>&emsp;Functional norms, condition numbers<br/>&emsp;and numerical algorithms in algebraic geometry <a class="btn btn-arxiv" href="https://arxiv.org/abs/2102.11727" role="button">arXiv:2102.11727</a> <a class="btn btn-open-access" href="https://doi.org/10.1017/fms.2022.89" role="button"><i class="ai ai-open-access"></i> OA paper</a></h4></div>
	 <div class="pretalktitle"></div><div class="collaborator">F. Cucker, A.A. Erg&uuml;r and J. Tonelli-Cueto. Functional norms, condition numbers and numerical algorithms in algebraic geometry (Ingl&eacute;s) [Normas funcionales, n&uacute;meros de condici&oacute;n y algoritmos num&eacute;ricos], <i>Forum of Mathematics, Sigma</i>, 10:e103, 2022. <span><a href="https://doi.org/10.1017/fms.2022.89">DOI 10.1017/fms.2022.89</a></span></div>
	</div>

	<br/><div class="cv">
	<div class="year"></div><div class="paper"><h4>&emsp;A Geometric Summation of the Geometric Series<a class="btn btn-hal" href="https://hal.inria.fr/hal-03779492" role="button">hal-03779492</a></h4></div>
	 <div class="pretalktitle"></div><div class="collaborator">J. Tonelli-Cueto. A Geometric Summation of the Geometric Series (Ingl&eacute;s) [Una Suma Geom&eacute;trica de la Serie Geom&eacute;trica], <i>The American Mathematical Monthly</i>, 129(10):974, 2022. <span><a href="https://doi.org/10.1080/00029890.2022.2115825">DOI 10.1080/00029890.2022.2115825</a></span> <span><a style="color:#FF69B4;" href="../papers/A_Geometric_Summation_of_the_Geometric_Series_AM.pdf">[AM for downloading]</a></span></div>
	</div>

  <br/><div class="cv">
  <div class="year"></div><div class="paper"><h4>&emsp;On the Complexity of the Plantinga-Vegter Algorithm<a class="btn btn-arxiv" href="https://arxiv.org/abs/2004.06879" role="button">arXiv:2004.06879</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">F. Cucker, A.A. Erg&uuml;r and J. Tonelli-Cueto. On the Complexity of the Plantinga-Vegter Algorithm (Ingl&eacute;s) [Sobre la Complejidad del Algoritmo Plantinga-Vegter], <i>Discrete & Computational Geometry</i>, 68(3):664–708, 2022. <!--First on-line: January 2021.--> <span><a href="https://doi.org/10.1007/s00454-022-00403-x">DOI 10.1007/s00454-022-00403-x</a></span> <span><a style="color:#FF69B4;" href="https://rdcu.be/cUAbS">[SharedIt LINK]</a></span></div>
   <div class="pretalktitle"></div><div class="collaborator">Versi&oacute;n de revista de <em>Plantinga-Vegter algorithm takes average polynomial time</em>. </div>
  </div>

  <br/><div class="cv">
  <div class="year"><h4>2021</h4></div><div class="paper"><h4>&emsp;Computing the Homology of Semialgebraic Sets. II: General Formulas<a class="btn btn-arxiv" href="https://arxiv.org/abs/1903.10710" role="button">arXiv:1903.10710</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">P. B&uuml;rgisser, F. Cucker y J. Tonelli-Cueto. Computing the Homology of Semialgebraic Sets. II: General Formulas (Ingl&eacute;s) [Computando la Homolog&iacute;a de los Conjuntos Semialgebraicos. II: F&oacute;rmulas Generales], <i>Foundations of Computational Mathematics</i>, 21(5):1279–1316, 2021. First on-line: January 2021. <span><a href="https://doi.org/10.1007/s10208-020-09483-8">DOI 10.1007/s10208-020-09483-8</a></span> <span><a style="color:#FF69B4;" href="https://rdcu.be/cc3Eq">[SharedIt LINK]</a></span></div>
  </div>

  <br/><div class="cv">
  <div class="year"><h4>2020</h4></div><div class="paper"><h4>&emsp;Computing the Homology of Semialgebraic Sets. I: Lax Formulas<a class="btn btn-arxiv" href="https://arxiv.org/abs/1807.06435"  role="button">arXiv:1807.06435</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">P. B&uuml;rgisser, F. Cucker y J. Tonelli-Cueto. Computing the Homology of Semialgebraic Sets. I: Lax Formulas (Ingl&eacute;s) [Computando la Homolog&iacute;a de los Conjuntos Semialgebraicos. I: F&oacute;rmulas Laxas], <i>Foundations of Computational Mathematics</i>, 20(1):71-119, 2020. First on-line: May 2019. <span><a href="https://doi.org/10.1007/s10208-019-09418-y">DOI 10.1007/s10208-019-09418-y</a></span> <span><a style="color:#FF69B4;" href="https://rdcu.be/cc68T">[SharedIt LINK]</a></span></div>
  </div>

  <br/><div class="cv">
  <div class="year"><h4>2019</h4></div><div class="paper"><h4>&emsp;On the Number of Real Zeros of Random Fewnomials
  <a class="btn btn-arxiv" href="https://arxiv.org/abs/1811.09425"  role="button">arXiv:1811.09425</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator"> P. B&uuml;rgisser, A.A. Erg&uuml;r y J. Tonelli-Cueto. On the Number of Real Zeros of Random Fewnomials (Ingl&eacute;s) [Sobre el N&uacute;mero de Ceros Reales de los Oligonomios Aleatorios], <i>SIAM Journal on Applied Algebra and Geometry</i>, 3(4):721–732, 2019. <span><a href="https://doi.org/10.1137/18M1228682">DOI 10.1137/18M1228682</a></span></div>
  </div>

</div>
<hr>
<div id="conferencepapers">
  <h2 class="display-4">Art&iacute;culos cient&iacute;ficos de conferencia</h2>

  <br/><div class="cv">
   <div class="year"><h4>2022</h4></div><div class="paper"><h4>&emsp;Beyond Worst-Case Analysis for Root Isolation Algorithms<a class="btn btn-arxiv" href="https://arxiv.org/abs/2202.06428v3" role="button">arXiv:2202.06428v3</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">A.A. Erg&uuml;r, J. Tonelli-Cueto y E. Tsigaridas. Beyond Worst-Case Analysis for Root Isolation Algorithms (Ingl&eacute;s) [M&aacute;s all&aacute; del An&aacute;lisis del Peor Caso en Algoritmos de Aislamiento de Ra&iacute;ces]. En <i>Proceedings of the 2022 International Symposium on Symbolic and Algebraic Computation</i>, ISSAC'22, p&aacute;ginas 139–148. ACM, 2022. <span><a href="https://doi.org/10.1145/3476446.3535475">DOI 10.1145/3476446.3535475</a></span> <span><a style="color:#FF69B4;" href="https://dl.acm.org/doi/10.1145/3476446.3535475?cid=99659444592">[Author-Ized LINK]</a></span></div>
  </div>

  <br/><div class="cv">
   <div class="year"></div><div class="paper"><h4>&emsp;On the Error of Random Sampling:<br/>Uniformly Distributed Random Points on Parametric Curves<a class="btn btn-arxiv" href="https://arxiv.org/abs/2203.02832v2" role="button">arXiv:2203.02832v2</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">A. Chalkis, Ch. Katsamaki y J. Tonelli-Cueto. On the Error of Random Sampling: Uniformly Distributed Random Points on Parametric Curves (Ingl&eacute;s) [Sobre el Error del Sampleo Aleatorio: Puntos Uniformemente Distribuidos en Curvas Param&eacute;tricas]. En <i>Proceedings of the 2022 International Symposium on Symbolic and Algebraic Computation</i>, ISSAC'22, p&aacute;ginas 273–282. ACM, 2022. <span><a href="https://doi.org/10.1145/3476446.3536190">DOI 10.1145/3476446.3536190</a></span> <span><a style="color:#FF69B4;" href="https://dl.acm.org/doi/10.1145/3476446.3536190?cid=99659444592">[Author-Ized LINK]</a></span></div>
  </div>

	<br/><div class="cv">
	 <div class="year"></div><div class="paper"><h4>&emsp;Ultrametric Smale's $\alpha$-theory<a class="btn btn-arxiv" href="https://arxiv.org/abs/2206.08392" role="button">arXiv:2206.08392</a></h4></div>
	 <div class="pretalktitle"></div><div class="collaborator">J.G. Suchen and J. Tonelli-Cueto. Ultrametric Smale's $\alpha$-theory (Ingl&eacute;s) [Teor&iacute;a $\alpha$ de Smale Ultram&eacute;trica], <i>ACM Communications in Computer Algebra</i>, 56(2):56-59, June 2022. <span><a href="https://doi.org/10.1145/3572867.3572875">DOI 10.1145/3572867.3572875</a></span> <span><a style="color:#FF69B4;" href="https://dl.acm.org/doi/10.1145/3572867.3572875?cid=99659444592">[Author-Ized LINK]</a></span></div>
	</div>

  <br/><div class="cv">
   <div class="year"></div><div class="paper"><h4>&emsp;Generalized Perron roots and solvability of the absolute value equation<a class="btn btn-hal" href="https://hal.inria.fr/hal-03739462" role="button">hal-03739462</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">M. Radons y J. Tonelli-Cueto. Generalized Perron roots and solvability of the absolute value equation (Ingl&eacute;s) [Ra&iacute;ces generalizadas de Perron y la ecuaci&oacute;n del valor absoluto]. En L.F. Tabera Alonso (ed.), <a href="https://dmd2022.unican.es/"><i>Discrete Mathematics Days 2022</i></a>, p&aacute;ginas 237-242. Editorial Universidad de Cantabria, 2022. <span><a href="https://doi.org/10.22429/Euc2022.016">DOI 10.22429/Euc2022.016</a></span></div>
  </div>

  <br/><div class="cv">
  <div class="year"><h4>2020</h4></div><div class="paper"><h4>&emsp;Condition Numbers for the Cube.<br/>&emsp;I: Univariate Polynomials and Hypersurfaces<a class="btn btn-arxiv" href="https://arxiv.org/abs/2006.04423v1" role="button">arXiv:2006.04423v1</a></h4></div>
  <div class="pretalktitle"></div><div class="collaborator">J. Tonelli-Cueto y E. Tsigaridas. Condition Numbers for the Cube. I: Univariate Polynomials and Hypersurfaces (Ingl&eacute;s) [N&uacute;meros de Condici&oacute;n para el Cubo. I: Polinomios Univariados e Hipersuperficies]. En <i>Proceedings of the 2020 International Symposium on Symbolic and Algebraic Computation</i>, ISSAC'20, p&aacute;ginas 434-441. ACM, 2020. <span><a href="https://doi.org/10.1145/3373207.3404054">DOI 10.1145/3373207.3404054</a></span> <span><a style="color:#FF69B4;" href="https://dl.acm.org/doi/10.1145/3373207.3404054?cid=99659444592">[Author-Ized LINK]</a></span></div>
  </div>


  <br/><div class="cv">
  <div class="year"><h4>2019</h4></div><div class="paper"><h4>&emsp;Plantinga-Vegter algorithm takes average polynomial time<a class="btn btn-arxiv" href="https://arxiv.org/abs/1901.09234"  role="button">arXiv:1901.09234</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">F. Cucker, A.A. Erg&uuml;r y J. Tonelli-Cueto. Plantinga-Vegter Algorithm takes Average Polynomial Time (Ingl&eacute;s) [El Algoritmo de Plantinga-Vegter toma Tiempo Promedio Polin&oacute;nimo]. En <i>Proceedings of the 2019 International Symposium on Symbolic and Algebraic Computation</i>, ISSAC'19, p&aacute;ginas 114-121. ACM, 2019. <span><a href="https://doi.org/10.1145/3326229.3326252">DOI 10.1145/3326229.3326252</a></span> <span><a style="color:#FF69B4;" href="https://dl.acm.org/doi/10.1145/3326229.3326252?cid=99659444592">[Author-Ized LINK]</a></span></div>
  </div>

</div>
<hr>
<div id="other">
  <h2 class="display-4">Otras publicaciones</h2>

  <br/><div class="row"><div class="col-md-12">
  <h3>Tesis</h3>
  </div></div>

  <br/><div class="cv">
  <div class="year"><h4>2019</h4></div><div class="paper"><h4>&emsp;Condition  and  Homology  in  Semialgebraic  Geometry<a class="btn btn-phd" href="doctoralthesis_es.html" role="button">tesis doctoral</a></h4></div>
   <div class="pretalktitle"></div><div class="collaborator">J. Tonelli-Cueto. <i>Condition  and  Homology  in  Semialgebraic  Geometry (Ingl&eacute;s) [Condici&oacute;n y Homolog&iacute;a en Geometr&iacute;a Semialgebraica]</i>. Tesis doctoral, Technsiche Universit&auml;t Berlin, Repositorio DepositOnce, diciembre 2019. <span><a href="http://dx.doi.org/10.14279/depositonce-9453">DOI 10.14279/depositonce-9453</a></span></div>
  </div>

 </div>
<br/>
</div>
</div>

<footer>
<hr>
    <p style="text-align:left;">&emsp;&emsp;&copy;Josu&eacute; Tonelli-Cueto
        <span id="finalsentence" style="float:right;"> C&oacute;digo de la p&aacute;gina creado por el arte de copiar, pegar y cruzar los dedos&emsp;&emsp;</span></p>
<hr style="margin: 0;">
</footer> <!--  /container  -->

    <!-- Bootstrap core JavaScript
    ================================================== -->
    <!-- Placed at the end of the document so the pages load faster -->
    <script src="https://code.jquery.com/jquery-3.1.1.slim.min.js" integrity="sha384-A7FZj7v+d/sdmMqp/nOQwliLvUsJfDHW+k9Omg/a/EheAdgtzNs3hpfag6Ed950n" crossorigin="anonymous"></script>
    <script>window.jQuery || document.write('<script src="../../assets/js/vendor/jquery.min.js"><\/script>')</script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/tether/1.4.0/js/tether.min.js" integrity="sha384-DztdAPBWPRXSA/3eYEEUWrWCy7G5KFbe8fFjk5JAIxUYHKkDx6Qin1DkWx51bBrb" crossorigin="anonymous"></script>
    <script src="js/bootstrap.min.js"></script>
    <!-- IE10 viewport hack for Surface/desktop Windows 8 bug -->
    <script src="js/ie10-viewport-bug-workaround.js"></script>
    <!-- For phone -->
    <script type="text/javascript">
    <!--
    if (screen.width <= 699) {
    document.getElementById("navbarCV").innerHTML="";
    var x;
    x = document.getElementsByTagName("H4");
    var i;
      for (i = 0; i < x.length; i++) {
       x[i].style="font-size:1em;font-weight:bold;";
      }
    x = document.getElementsByClassName("btn btn-arxiv");
    for (i = 0; i < x.length; i++) {
     x[i].style="width:100%;";
    }
    x = document.getElementsByClassName("btn btn-hal");
    for (i = 0; i < x.length; i++) {
     x[i].style="width:100%;";
    }
    x = document.getElementsByClassName("btn btn-phd");
    for (i = 0; i < x.length; i++) {
     x[i].style="width:100%;";
    }
    x = document.getElementsByClassName("year");
    for (i = 0; i < x.length; i++) {
     if (!(x[i].innerHTML === "")){
     x[i].style="width:6em;";}
     else{
       x[i].style="width:0%;";
     }
    }
    x = document.getElementsByClassName("paper");
    for (i = 0; i < x.length; i++) {
     x[i].style="width:100%;";
    }
    x = document.getElementsByClassName("pretalktitle");
    for (i = 0; i < x.length; i++) {
     x[i].style="width:0%;";
    }
    x = document.getElementsByClassName("collaborator");
    for (i = 0; i < x.length; i++) {
     x[i].style="width:100%;";
    }
    document.getElementById("finalsentence").innerHTML="";
    }
    //-->
    </script>
    <!-- For math expression-->
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
       tex2jax: {
         inlineMath: [ ['$','$'], ["\\(","\\)"] ],
        processEscapes: true
        }
       });
    </script>
     <script type="text/javascript" src='https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-MML-AM_CHTML' async></script>
  </body>
</html>
